MasEmIOT/Final_Project_CTTN/code/NodeSensor_test/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# === Bang phan vung ho tro OTA (2 slot app + otadata) ===
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota.csv"

# Bat rollback: firmware moi phai tu confirm (mark_valid), neu treo -> quay ban cu
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# OTA: cho phep tai qua HTTP (local server gateway) + HTTPS (CA bundle)
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Tick 1000Hz: de vTaskDelay(pdMS_TO_TICKS(<=10ms)) thuc su cho dung thoi gian
# (mac dinh 100Hz lam tron 5ms -> 0 tick, gay loi timeout LoRa).
CONFIG_FREERTOS_HZ=1000

# Manual light-sleep (esp_light_sleep_start) khong can PM framework.
CONFIG_PM_ENABLE=n
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n

# Task Watchdog: bat va cho panic (reset) khi treo
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y

# Run-time stats de profiling FreeRTOS (per-task CPU%, per-core)
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y
